app/controllers/vote_controller.rb

  def update
	  post = Post.find(params[:post_id])
    vote = post.vote

    vote.score += 1 if params[:vote][:score] == "Up"
    vote.score -= 1 if params[:vote][:score] == "Down"
    vote.users << current_user
    vote.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "votes" SET "score" = 1 WHERE "votes"."id" = 21

	def clear
    post = Post.find(params[:post_id])
    post.vote.update_attributes(:score => 0)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "27"]]
UPDATE "votes" SET "score" = 0 WHERE "votes"."id" = 22